<a href="https://colab.research.google.com/github/Sahiba2712/Sahiba/blob/master/Task_05.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#GO_STP_12366
##TASK-05
###Goeduhub technologies

1.Load the IMDb Dataset and read

In [ ]:
import numpy as np
import pandas as pd
df=pd.read_csv('IMDB-Movie-Data.csv')

2. View the dataset

In [4]:
df.head(10)

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0
5     6           The Great Wall  ...              45.13      42.0
6     7               La La Land  ...             151.06      93.0
7     8                 Mindhorn  ...                NaN      71.0
8     9       The Lost City of Z  ...               8.01      78.0
9    10               Passengers  ...             100.01      41.0

[10 rows x 12 columns]

3. Understand some basic information about the dataset and Inspect the dataframe Inspect the dataframe's columns, shapes, variable types etc.

In [5]:
df.columns
 
type(df)
 
df.dtypes
 
df.shape
 
df.size
 
df.ndim
 
df.values
 
df1 = df.values
 
type(df1)
 
df.describe()

              Rank         Year  ...  Revenue (Millions)   Metascore
count  1000.000000  1000.000000  ...          872.000000  936.000000
mean    500.500000  2012.783000  ...           82.956376   58.985043
std     288.819436     3.205962  ...          103.253540   17.194757
min       1.000000  2006.000000  ...            0.000000   11.000000
25%     250.750000  2010.000000  ...           13.270000   47.000000
50%     500.500000  2014.000000  ...           47.985000   59.500000
75%     750.250000  2016.000000  ...          113.715000   72.000000
max    1000.000000  2016.000000  ...          936.630000  100.000000

[8 rows x 7 columns]

4. Data Selection – Indexing and Slicing data

In [6]:
 
df.iloc[0]
df[1:20]
df[['Rating','Votes']].agg(['min','max','mean'])

      Rating        Votes
min   1.9000       61.000
max   9.0000  1791916.000
mean  6.7232   169808.255

5. Data Selection – Based on Conditional filtering

In [7]:
df.filter(items=['Rank', 'Votes'])
 
df['Rating']>7
 
top_rank = df[df["Rating"] > 8.0]["Title"].count()
 
print(top_rank)

59

 6. Groupby operations

In [8]:
 
df2 = df.groupby('Genre')
df2.mean()
df[df['Rating']>7].groupby('Genre')[['Rating']].count()
 top_movie = df[df["Rating"] > 8.0]
top_movie.groupby(["Title"])["Votes"].mean()

Title
12 Years a Slave                                 486338
3 Idiots                                         238789
Ah-ga-ssi                                         33418
Bahubali: The Beginning                           76193
Dangal                                            48969
Django Unchained                                1039115
El secreto de sus ojos                           144524
Gone Girl                                        636243
Gran Torino                                      595779
Guardians of the Galaxy                          757074
Hachi: A Dog's Tale                              177602
Hacksaw Ridge                                    211760
Harry Potter and the Deathly Hallows: Part 2     590595
How to Train Your Dragon                         523893
Incendies                                         92863
Inception                                       1583625
Inglourious Basterds                             959065
Inside Out                                       416689
Interstellar                                    1047747
Into the Wild                                    459304
Jagten                                           192263
Kimi no na wa                                     34110
Koe no katachi                                     2421
La La Land                                       258682
Lion                                             102061
Mad Max: Fury Road                               632842
Mommy                                             33560
No Country for Old Men                           660286
PK                                               103279
Paint It Black                                       61
Pan's Labyrinth                                  498879
Prisoners                                        431185
Relatos salvajes                                 110100
Room                                             224132
Rush                                             339722
Shutter Island                                   855604
Spotlight                                        268282
Star Wars: Episode VII - The Force Awakens       661608
Taare Zameen Par                                 102697
The Avengers                                    1045588
The Bourne Ultimatum                             525700
The Dark Knight                                 1791916
The Dark Knight Rises                           1222645
The Departed                                     937414
The Grand Budapest Hotel                         530881
The Help                                         342429
The Imitation Game                               532353
The Intouchables                                 557965
The Lives of Others                              278103
The Prestige                                     913152
The Wolf of Wall Street                          865134
There Will Be Blood                              400682
Toy Story 3                                      586669
Twin Peaks: The Missing Pieces                     1973
Up                                               722203
WALL·E                                           776897
Warrior                                          355722
Whiplash                                         477276
Zootopia                                         296853
Name: Votes, dtype: int64

 7. Sorting operation

In [9]:
x=df.sort_values(by='Rating')
x.head(10)
most_votes = df.groupby(["Votes"]).mean()
most_votes.sort_values(by = ["Votes"], ascending = False).head()

          Rank    Year  ...  Revenue (Millions)  Metascore
Votes                   ...
1791916   55.0  2008.0  ...              533.32       82.0
1583625   81.0  2010.0  ...              292.57       74.0
1222645  125.0  2012.0  ...              448.13       78.0
1047747   37.0  2014.0  ...              187.99       74.0
1045588   77.0  2012.0  ...              623.28       69.0

[5 rows x 6 columns]

8. Dealing with missing values

In [10]:
df.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

 9. Dropping columns and null values

In [11]:
 
df.dropna()
x = df.drop(['Metascore'], axis='columns', inplace=True)

10.Apply() function

In [12]:
 
rank = df.apply(lambda n: n*5)
print(rank.head())

   Rank  ... Revenue (Millions)
0     5  ...            1665.65
1    10  ...             632.30
2    15  ...             690.60
3    20  ...            1351.60
4    25  ...            1625.10

[5 rows x 11 columns]